package ru.bstu.it32.kurbatova.lab3;

/**
 * Написать программу, которая:
 * 1) Считывает с консоли количество фигур (распознавать количество фигур при вводе пользователем таких строк:
 * вап4явап, аа4а555 (в этом случае надо распознать первое число))
 * 2) В цикле считывает параметры. Сначала спрашивается тип фигуры и создается объект нужного класса.
 * Затем у объекта вызывается метод init() и вводятся характеристики объекта. Понятно, что метод init() разный у разных классов.
 * 3) Считанные объекты добавляются в массив
 * 4) Ищется фигура  с наибольшим периметром и выводится на экран (вывод через toString())
 *
 * */
public class Main {
    public static void main(String[] args)
    {

    }
}
